10/data/attachments/8dd790936511fca3.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_7a7d4e4f-fd83-4257-a088-faddf684ca2d</nif:username>
            <nif:friendToBeAdded>Larry_stock_Friend_8550_7</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>